In [1]:
# ETL PRoject

The aim of this project is to extract movies dataset from different sources, clean the data and insert into a postgres database. 
Technologies used will include:
Postgres Database
sqlalchemy library
Pandas
Source data willbe csv file pulled from imbd datasource

The dataset contains data on Movies, Actors and ratings. We intend to pull each dataset into a seperate table, and create joins that link actors to movies and ratings for insight into the dataset

In [1]:
import pandas as pd

In [2]:
data_source = 'Resources/'

In [3]:
movies_csv = data_source + 'IMDB movies.csv'
actors_csv = data_source + 'IMDB names.csv'
ratings_csv = data_source + 'IMDB ratings.csv'

In [4]:
actors = pd.read_csv(actors_csv)

/Users/richardnwokoye/opt/anaconda3/envs/PythonData/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3147: DtypeWarning: Columns (7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [5]:
actors.columns

Index(['imdb_name_id', 'name', 'birth_name', 'date_of_birth', 'place_of_birth',
       'date_of_death', 'reason_of_death', 'Unnamed: 7', 'Unnamed: 8',
       'Unnamed: 9',
       ...
       'Unnamed: 117', 'Unnamed: 118', 'Unnamed: 119', 'Unnamed: 120',
       'Unnamed: 121', 'Unnamed: 122', 'Unnamed: 123', 'Unnamed: 124',
       'Unnamed: 125', 'Unnamed: 126'],
      dtype='object', length=127)

In [8]:
actors = actors[['imdb_name_id','name','birth_name','date_of_birth','place_of_birth','date_of_death','reason_of_death']]

In [10]:
actors.head(3)

,imdb_name_id,name,birth_name,date_of_birth,place_of_birth,date_of_death,reason_of_death
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,1899-05-10,"Omaha, Nebraska, USA",6/22/1987,pneumonia
1,nm0000002,Lauren Bacall,Betty Joan Perske,9/16/1924,"The Bronx, New York City, New York, USA",8/12/2014,stroke
2,nm0000003,Brigitte Bardot,Brigitte Bardot,9/28/1934,"Paris, France",NaN,NaN

In [18]:
actors.head(3)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0

In [11]:
actors.dtypes

imdb_name_id       object
name               object
birth_name         object
date_of_birth      object
place_of_birth     object
date_of_death      object
reason_of_death    object
dtype: object

In [12]:
movies = pd.read_csv(movies_csv)

/Users/richardnwokoye/opt/anaconda3/envs/PythonData/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3147: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [13]:
movies.head(3)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0

In [14]:
ratings = pd.read_csv(ratings_csv)

In [15]:
ratings.head(3)

,imdb_title_id,weighted_average_vote,total_votes,mean_vote,median_vote,votes_10,votes_9,votes_8,votes_7,votes_6,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0000009,5.9,154,5.9,6.0,12,4,10,43,28,...,5.7,13.0,4.5,4.0,5.7,34.0,6.4,51.0,6.0,70.0
1,tt0000574,6.1,589,6.3,6.0,57,18,58,137,139,...,6.2,23.0,6.6,14.0,6.4,66.0,6.0,96.0,6.2,331.0
2,tt0001892,5.8,188,6.0,6.0,6,6,17,44,52,...,5.8,4.0,6.8,7.0,5.4,32.0,6.2,31.0,5.9,123.0